//פגיעה מבעל חיים
//שלבים לטיפול בעקיצת דבורה
const beeStingSteps = [
    'הסירו בעדינות את העוקץ בתנועת "ניגוב" (מבלי לצבוט אותו), ניתן לעשות זאת  בעזרת כרטיס אשראי או ציפורן.',
    "שטפו את איזור העקיצה עם מים וסבון.",
    "הניחו משהו קר על האיזור, אין לשים קרח ישירות על העור.",
    "חשוב מאוד לא לגרד את איזור העקיצה.",
    "ניתן למרוח דבש, אלוורה או תכשיר נגד אלרגיה.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "רשימת סימנים לאלרגיה: נפיחות באברי הגוף, כולל פנים או לשון, קשיים בבליעה, בחילה, סחרחרות, חרחורים וקשיי נשימה, כאב ראש, תחושת עילפון, כאב בטן, שלשולים והקאות.",
    "<b>במקרה שמופיע אחד מהסימנים או יותר יש לפנות לבית חולים באופן מידי.</b>"
]

//שלבים לטיפול בהכשת נחש
const snakeBiteSteps = [
    "התרחקו מהאיזור בו התרחשה ההכשה, מפני שהנחש עלול להכיש שנית.",
    "השכיבו את הילד בעדינות במנוחה מחולטת והתקשרו 101 למד’’א.",
    "הרגיעו את הילד והסירו ביגוד ותכשיטים מהאיזור שהוכש.",
    "קבעו את האיבר שהוכש כך שיהיה נמוך מגובה הלב.",
    "סמנו את איזור ההכשה בעיגול בעזרת עט.",
    "בשלב זה ניתן לתת לילד לשתות אך לא לתת לו לאכול.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "הימנעו משימוש בקרח, חוסם עורקים, חיתוך מקום ההכשה או מציצת הארס.",
    "פנו את הילד לבית חולים."]; 

//שלבים לטיפול בעקיצת עקרב
const scorpionStingSteps = [
    "השכיבו את הילד בעדינות במנוחה מחולטת והתקשרו 101 למד’’א.",
    "הרגיעו את הילד והסירו ביגוד ותכשיטים מהאיזור שנעקץ.",
    "קבעו את האיבר שנעקץ כדי למנוע התפשטות של הארס.",
    "הניחו משהו קר על האיזור, אין לשים קרח ישירות על העור.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
     "פנו את הילד לבית חולים."
];

//שלבים לטיפול בצריבת מדוזה
const jellyfishBurnSteps = [
    "הסירו בעדינות שאריות מדוזה מהעור בעזרת מקלון או חתיכת פלסטיק, אין לגעת בידים חשופות.",
    "שטפו את איזור העקיצה במי מלח.",
    "שטפו את מי המלח באמצעות זרם חזק של מי ברז.",
    "שימו לב- אין לנקות את איזור הצריבה באלכוהול או למרוח חומץ.",
    "הניחו משהו קר על האיזור, אין לשים קרח ישירות על העור.",
    "חשוב מאוד לא לגרד או לשפשף את איזור הצריבה.",
    "ניתן למרוח קרם או ג'ל אלוורה.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "במקרים שבהם נותרת כוויה חמורה על העור והכאבים לא שוככים – יש לפנות לטיפול רפואי.",
    "<b>במקרה של הקאות, התכווצויות שרירים או קשיי נשימה, נפיחות בגרון, הכחלת המקום או נפיחות גדולה באיזור מעבר לרגיל- יש לפנות לבית חולים באופן מיידי.</b>"
];

//שלבים לטיפול בנשיכת כלב וחתול
const dogCatBiteSteps = [
    "הרחיקו את הילד מהחיה הנושכת.",
    "במידה ויש דימום לחצו על מקום הנשיכה בעזרת מטלית או תחבושת יבשה עד להפסקת הדימום.",
    "שטפו את איזור הנשיכה עם מים וסבון.",
    "חטאו את הפצע בעזרת תמיסת יוד, מי חמצן או אלכוהול.",
    "לאחר שהפצע התייבש מרחו אותו במשחה אנטיביוטית.",
    "ניתן להשאיר את הפצע חשוף או לחילופין להניח עליו בד או מגבת נקייה ספוגה במים קרים.",
    "אין להפעיל לחץ על איזור הנשיכה, במידה ורוצים לחבוש ניתן לחבוש בתחבושת רפויה.",
    "הניחו משהו קר על האיזור, אין לשים קרח ישירות על עור.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "בסיום הטיפול יש לקחת את הילד לבדיקה אצל הרופא." 
];

//שלבים לטיפול בעקיצת קרצייה
const tickStingSteps = [
    "הסירו את הקרציה בשלמותה, עדיף באמצעות פינצטה ולא באמצעות הידיים, מבלי למעוך אותה על הגוף.",
    "שטפו את איזור העקיצה עם מים וסבון.",
    "הניחו משהו קר על האיזור, אין לשים קרח ישירות על העור.",
    "חשוב מאוד לא לגרד את איזור העקיצה.",
    "רשמו את התאריך בו עקצה הקרציה.",
    "אם הילד סובל מחום, כאבי ראש, פריחה בכפות הידיים והרגלים בין 14 עד 21 יום מרגע העקיצה- יש לפנות לרופא ולהזכיר את עקיצת הקרציה."
];


//שלבים לטיפול בנשיכת עכביש, עקיצת חרק
const spiderBiteSteps = [
    "שטפו את איזור העקיצה עם מים וסבון.",
    "הניחו משהו קר על האיזור, אין לשים קרח ישירות על העור.",
    "חשוב מאוד לא לגרד את איזור העקיצה.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "<b>במקרה של קשיים בנשימה, נפיחות שמתפשטת באיזור הגפיים והפנים, סחרחורות, התכווצויות קשות וכאבי בטן קשים, פריחה שמתחילה באיזור העקיצה ומתפשטת לשאר חלקי הגוף-יש לפנות לבית חולים באופן מיידי.</b>"
];

//משתנים להחזקת מערכי טיפול בפגיעה מבעל חיים
const beeSting = ["beeSting", "עקיצת דבורה וצרעה", beeStingSteps];
const snakeBite = ["snakeBite", "הכשת נחש", snakeBiteSteps];
const scorpionSting = ["scorpionSting", "עקיצת עקרב", scorpionStingSteps];
const jellyfishBurn = ["jellyfishBurn", "צריבת מדוזה", jellyfishBurnSteps];
const dogCatBite = ["dogCatBite", "נשיכת כלב או חתול", dogCatBiteSteps];
const tickSting = ["tickSting", "עקיצת קרצייה", tickStingSteps];
const spiderBite = ["spiderBite", "נשיכת עכביש, עקיצת חרק", spiderBiteSteps];


//משתנה להחזקת כל מערכי הטיפול בפגיעה מבעל חיים 
const animalInjuryList = ["פגיעה מבעל חיים", "animalInjury", [beeSting, snakeBite, scorpionSting, jellyfishBurn, dogCatBite, tickSting, spiderBite]];

//כאבים
//שלבים לטיפול בכאב אוזניים
const earsPainSteps = [
    "השכיבו את הילד על הצד כאשר האוזן הכואבת פונה מעלה.",
    "ניתן להקל על הכאב באמצעות לעיסת מסטיק, ניפוח בלון או פיהוק.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "במידה ואין הפרשה מהאוזן ניתן להשתמש גם בטיפות אוזניים.",
    "מומלץ להרבות בשתיית מים, כדאי להמנע משתייה מוגזת.",
    "יש להימנע משימוש בקיסמי אוזניים או החדרת שמנים או כל נוזל אחר שאינו ייעודי- לתוך האוזניים." 
];

//שלבים לטיפול בכאב בטן
const tummyPainSteps = [
    `כאבי בטן נובעים מסיבות רבות ומגוונות, <br/>
על מנת להעניק את הטיפול המדוייק מומלץ ליצור קשר עם המרפאה בה הילד מטופל, <br/>
או לחילופין לפנות לאחת ממרפאות החירום: <br/>
<b>טרם:</b> <a href="https://www.terem.com/Clinics.aspx?lang=1" style="color:#3460E0"> לחץ לאיתור או יצירת קשר עם מרפאת טרם </a> <br/>
<b>ביקורופא:</b> <a href="http://www.bikurofe.co.il/clinics" style="color:#3460E0"> לחץ לאיתור או יצירת קשר עם מרפאת ביקורופא </a> <br/>
`
];

//שלבים לטיפול בכאב ראש
const headPainSteps = [
    `כאבי ראש נובעים מסיבות רבות ומגוונות, <br/>
על מנת להעניק את הטיפול המדוייק מומלץ ליצור קשר עם המרפאה בה הילד מטופל, <br/>
או לחילופין לפנות לאחת ממרפאות החירום: <br/>
<b>טרם:</b> <a href="https://www.terem.com/Clinics.aspx?lang=1" style="color:#3460E0"> לחץ לאיתור או יצירת קשר עם מרפאת טרם </a> <br/>
<b>ביקורופא:</b> <a href="http://www.bikurofe.co.il/clinics" style="color:#3460E0"> לחץ לאיתור או יצירת קשר עם מרפאת ביקורופא </a> <br/>
`
];

//שלבים לטיפול בכאב שיניים
const teethPainSteps = [
    "המיסו כפית גדושה של מלח בחצי כוס מים פושרים ותנו לילד לגרגר את מי המלח.",
    "ניתן להקל על הכאב באמצעות תה מחליטת נענע, מציצת קרח או הנחת חתיכת שום על המקום הכואב." ,
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
];

//משתנים להחזקת מערכי טיפול בכאבים
const earsPain = ["earsPain", "כאב אוזניים", earsPainSteps];
const tummyPain = ["tummyPain", "כאב בטן", tummyPainSteps];
const headPain = ["headPain", "כאב ראש", headPainSteps]
const teethPain = ["teethPain", "כאב שיניים", teethPainSteps];

//משתנה להחזקת כל מערכי הטיפול בכאבים 
const painList = ["כאבים", "pain", [earsPain, tummyPain, headPain, teethPain]];

//מערכת העיכול
//שלבים לטיפול בהקאות
const nauseaList = [
    "השקו את הילד בנוזלים בכמויות קטנות ובתדירות גבוהה, ניתן להשקות את הילד באמצעות כף או מזרק.",
    "מומלץ לתת נוזלים המכילים תוכן, למשל: מרק צח.",
    "ניתן להשתמש בקרטיבים על מנת להגביר את שיתוף הפעולה מצד הילד.",
    "ודאו כי הילד מקבל מספיק מנוחה.",
    "סימנים להתייבשות: עייפות או עצבנות, פה יבש, מיעוט דמעות בעת בכי, עור קריר, עיניים שקועות, שתן מועט וכהה מהרגיל או שתן עם ריח חריף.",
    "<b>במקרה של התייבשות, כאבי בטן חמורים, כאבי ראש חזקים, חום מעל 39 מעלות, הקאות מלוות בדם או צוואר נוקשה- יש לפנות לבית חולים.</b>"
];

//שלבים לטיפול בשלשולים
const diarrheaList = [
    "השקו את הילד בנוזלים בכמויות קטנות ובתדירות גבוהה.",
    "מומלץ לתת נוזלים המכילים תוכן, למשל: מרק צח.",
    "ניתן להשתמש בקרטיבים על מנת להגביר את שיתוף הפעולה מצד הילד.",
    "מומלץ להגביר תזונה עוצרת כמו אורז, בננות, תפוחי אדמה מבושלים ללא תיבול, עוף שהתבשל במרק וכדומה.",
    "סימנים להתייבשות: עייפות או עצבנות, פה יבש, מיעוט דמעות בעת בכי, עור קריר, עיניים שקועות, שתן מועט וכהה מהרגיל או שתן עם ריח חריף.",
];

//שלבים לטיפול בעצירות
const constipationList = [
    "תנו לילד מזונות עשירים בסיבים תזונתיים כמו: ירקות, פירות ודגנים מלאים.",
    "ודאו כי הילד מרבה בשתיית נוזלים.",
    "ניתן להשתמש בנרות גליצרין או בשמן פרפין למניעת מאמץ בהתרוקנות.",
    "ודאו כי הילד מקיים פעילות גופנית סדירה.",
    "שימו לב ובדקו האם מדובר בעצירות על רקע רגשי או תחושתי." 
];

//שלבים לטיפול בצרבת
const heartburnList = [
    "דאגו שהילד יאכל ארוחות קטנות לאורך כל היום.",
    "וודאו כי הילד לא אוכל כשעתיים או שלוש שעות לפני השינה.",
    "מנעו מהילד מזונות מתובלים, מטוגנים או חומציים ומשקאות המכילים קפאין.",
    "הגבהיו מעט את ראש המיטה של הילד באמצעות הצבת בלוקים של עץ מתחת למיטה (כריות נוספות לא יספקו פתרון לבעיה).",
    "הלבישו את הילד בבגדים רפויים ולא לוחצים."
];

//משתנים להחזקת מערכי טיפול במערכת העיכול
const nausea = ["nausea", "הקאות", nauseaList];
const diarrhea = ["diarrhea", "שלשולים", diarrheaList];
const constipation = ["constipation", "עצירות", constipationList];
const heartburn = ["heartburn", "צרבת", heartburnList];

//משתנה להחזקת כל מערכי הטיפול במערכת העיכול 
const digestionList = ["מערכת העיכול", "digestion", [nausea, diarrhea, constipation, heartburn]];

//נפילות
//שבר ונקע
const fractionList = [
    "שימו לב- אין לנסות להזיז וליישר את האזור שנפגע.",
    "השכיבו או הושיבו את הילד בתנוחה הנוחה לו.",
    "קבעו באמצעות בד את האזור שנפגע למקום אחר בגוף כך שלא יזוז.",
    "הסירו ביגוד ותכשיטים מהאיזור שנפגע.",
    "ודאו ששום דבר לא לוחץ על אזור הפגיעה.",
    "הניחו משהו קר על האיזור, אין לשים קרח ישירות על העור.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "בשלב זה ניתן לתת לילד לשתות אך לא לתת לו לאכול.",
    "בסיום הטיפול יש לקחת את הילד לבדיקה אצל רופא."  
];

//שפשוף, שריטה וחתך
const bruiseList = [
    "שטפו את הידיים היטב לפני תחילת הטיפול בילד.",
    "שטפו בעדינות את הפצע עם מים וסבון או עם מי חמצן 3% והסירו ממנו לכלוכים.",
    "חטאו את הפצע עם יוד ללא אלכוהול.",
    "חבשו את הפצע בצורה מהודקת אך לא לוחצת.",
    "הניחו משהו קר על האיזור, אין לשים קרח ישירות על העור.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "בסיום הטיפול יש לוודא שהילד מחוסן לטטנוס.",
    "<b>יש לגשת לרופא במקרים של פציעה באזור הפנים, העיניים או הפה, דימום שלא נפסק, כאבים עזים, פציעה עמוקה, חשיפה לחומרים מתכתיים או חלודים כמו מסמרים או ברגים.</b>" 
];

//משתנים להחזקת מערכי טיפול בנפילות
const fraction = ["fraction", "שבר ונקע", fractionList];
const bruise = ["bruise", "שפשוף, שריטה וחתך", bruiseList]

//משתנה להחזקת כל מערכי הטיפול בנפילות 
const fallList = ["נפילות", "falls", [fraction, bruise]];

//כללי
//דימום מהאף
const noseBleedList = [
    "סתמו את האף של הילד באמצעות לחיצה על הנחיריים, עם שתי אצבעות כמו אטב. שימו לב- לא ללחוץ בחלק העליון של האף.",
    "הטו את הראש של הילד קדימה כשהפנים לכיוון הרצפה.",
    "המשיכו בלחיצה על הנחיריים במשך חמש דקות.", 
    "הרגיעו את הילד והדריכו אותו לנשום מהפה.",
    "הניחו קומפרסים קרים על האף למשך מספר דקות.",
    "שימו לב- לא להשכיב את הילד ולא להטות את ראשו אחורה, לא לדחוף צמר גפן לנחיריים, לא לנקות את האף של הילד אחרי שהדימום פסק, להמנע מקינוח האף.",
    "<b>יש לגשת לבית חולים במקרים הבאים: אם הדימום הוא תוצאה של חבלה בראש או בפנים, אם הדימום נמשך למעלה מרבע שעה או אם הדימום חוזר ומתחדש לאחר שפסק.</b>"
];

//חום
const feverList = [
    "תנו לילד תרופה להורדת החום.",
    "השקו את הילד בנוזלים בתדירות גבוהה, אין צורך לאכול אם אין תיאבון.",
    "הלבישו את הילד בבגדים רפויים ולא לוחצים.",
    "הימנעו מחימום החדר והקפידו לאוורר אותו היטב.",
    "העבירו מגבת בד שנטבלה במים על גבי המצח, הגב, החזה, המפשעה ושורש כף היד של הילד.",
    "ניתן לעשות לילד אמבטיה עם מים פושרים.",
    "ניתן למהול חצי כוס חומץ בכוס מים ולמרוח באמצעות צמר גפן על הברכיים, המרפקים, בית השחי והעורף של הילד.",
    "<b>יש לפנות לבית חולים במקרים של עליית חום מהירה ורעד, צוואר נוקשה, כאבי ראש חמורים, רגישות לאור, חולשה משמעותית, בלבול אצל הילד, הופעת נקודות אדומות שאינן מתבהרות בלחיצה עליהן, נשימה מהירה או קושי בנשימה, חוסר הסכמה לשתייה, הזלת ריר רב, עור חיוור או כחול, רעד, כאבים חזקים או תזוזה בלתי נשלטת בידיו או רגליו של הילד.</b>" 
];

//שיעול
const coughList = [
    "הושיבו את הילד בחדר אמבטיה מהביל כ-20 דקות על מנת שינשום את האדים.",
    "במידה ויש ברשותכם מכשיר אדים הפעילו אותו בחדר השינה של הילד.",
    "דאגו שהילד ירבה בשתיית נוזלים, יש להמנע ממשקאות מוגזים או מיצי הדרים אשר מגרים את הגרון.",
    "<b>יש לפנות לבית החולים במקרה שמופיע אחד מהתסמינים הבאים: שיעול קשה, נשימה מהירה, קשיי נשימה, צפצופים, צליל גבוה בזמן הנשימה, צבע כחול או חיוור בשפתיים, בפנים או בלשון במהלך שיעול או אחריו.</b>"
];

//עצם זר בעין
const eyeDirtList = [
    "חשוב מאוד לדאוג שהילד לא ישפשף את העין.",
    "הושיבו את הילד עם הפנים לכיוון האור כדי שתוכלו לראות טוב יותר את העין.",
    "הטו את הראש של הילד אחורה ופתחו את העפעפיים שלו כדי לראות מה נכנס לעין.",
    "שטפו את העין היטב במים כדי להוציא את מה שנכנס.",
    "אם העצם הזר לא יצא, או שיש כאבים- שימו פד סטרילי על העין וגשו לרופא לבדיקה."
];

//משתנים להחזקת מערכי טיפול בכללי
const noseBleed = ["noseBleed", "דימום מהאף", noseBleedList];
const fever = ["fever", "חום", feverList];
const cough = ["cough", "שיעול", coughList];
const eyeDirt = ["eyeDirt", "עצם זר בעין", eyeDirtList];

//משתנה להחזקת כל מערכי הטיפול בכללי 
const generalList = ["כללי", "general", [noseBleed, fever, cough, eyeDirt]];

//כוויה
const burnsList = [
    "שטפו היטב את הידיים לפני תחילת הטיפול בילד.",
    "הסירו מהילד בגדים או תכשיטים הסמוכים לאזור הכוויה, שימו לב- אם ישנם חלקי לבוש דבוקים לכוויה- אין לנסות להסיר אותם!",
    "קררו את אזור הכוויה מתחת למים זורמים וקרירים, במשך 15 דקות.",
    "הימנעו משימוש בקרח, זה עלול לגרום לנזק נוסף.",
    "אם הכאב חזק ומציק אפשר לתת סירופ נגד כאב לילדים.",
    "<b>במקרים של הופעת שלפוחיות ביותר מאזור אחד בגוף או במקרה שבו העור התקלף לחלוטין- התקשרו 101 למד''א או פנו את הילד באופן מיידי לבית החולים.</b>"
];

//משתנים להחזקת כל מערכי הטיפול בכוויות 
const burns = ["burn", "כוויות", burnsList]
const burnList = ["כוויות", "burn", [burns]];

//התעלפות ואיבוד הכרה
const faintingsList = [
    "בדקו אם הילד בהכרה, על ידי קריאה בשמו וטפיחות קלות על רגליו.",
    "אם הילד מגיב הרימו את הרגליים שלו, ושחררו בגדים לוחצים.",
    "אם הילד אינו מגיב, בדקו האם הוא נושם.",
    ["במידה והילד לא נושם, שימו יד על יד ולחצו על בית החזה של הילד, בין הפטמות לפי הקצב הבא:", " השמע קצב "],
    "חייגו 101 למד''א והזמינו אמבולנס, המשיכו בלחיצות עד להגעתו."
];

//משתנים להחזקת כל מערכי הטיפול בהתעלפות ואיבוד הכרה 
const faintings = ["fainting", "התעלפות ואיבוד הכרה", faintingsList]
const faintingList = ["התעלפות ואיבוד הכרה", "fainting", [faintings]];

//התחשמלות
const electrocutionsList = [
    "חשוב מאוד! נתקו את זרם החשמל לפני שאתם ניגשים לילד. אם לא ניתן לנתק את החשמל, הרחיקו את הילד ממקור ההתחשמלות באמצעות חפץ מפלסטיק או מעץ (לדוגמה, מקל של מטאטא).",
    "בדקו אם הילד בהכרה, על ידי קריאה בשמו וטפיחות קלות על רגליו.",
    "אם הילד אינו מגיב, בדקו האם הוא נושם.",
    ["אם הילד אינו נושם, שימו יד על יד ולחצו על בית החזה של הילד, בין הפטמות, לפי הקצב הבא: ", "השמע קצב"],
    "חייגו 101 למד''א והזמינו אמבולנס, המשיכו בלחיצות עד להגעתו.",
    "יש לדאוג שהגוף של הילד לא יהיה קר." 
];

//משתנים להחזקת כל מערכי הטיפול בהתחשמלות 
const electrocutions = ["electrocution", "התחשמלות", electrocutionsList]
const electrocutionList = ["התחשמלות", "electrocution", [electrocutions]];

//משתנים להחזקת כל מערכי הגשת עזרה ראשונה 
export const baseCategories = [animalInjuryList, painList, fallList, faintingList, digestionList, generalList, burnList, electrocutionList];


//חנק
const chokingContentList = ["מה צריך לעשות כשרואים ילד נחנק?",
    "עודדו את הילד להשתעל",
    "במקרה שהילד אינו מדבר ואינו משתעל, כופפו את הילד קדימה.",
    "תנו כ- 5 מכות בגב בין השכמות, באמצע הגב עם יד פתוחה." ,
    "בדקו בפיו של הילד אם ניתן לראות ולהוציא את הגוף הזר.",
    "אם הגוף הזר לא יוצא, עמדו מאחורי הילד וכרכו את זרועותיכם סביב מותניו.",
    "אגרפו כף יחד אחת, הניחו את אגרופכם (כשהאגודל בכיוון הבטן) מעל טבורו של הילד, מתחת לעצם החזה.",
    "תפסו את האגרוף בכף ידכם השנייה ולחצו כ- 5 לחיצות מהירות על הבטן כלפי מעלה ופנימה, הימנעו מלחיצות חזקות מדי שירימו את הילד מעל גובה הרצפה.",
    "המשיכו לבצע 5 פעמים מכות בגב, 5 פעמים לחיצות חזה עד לשחרור הגוף הזר.",
    `אם הילד מאבד את הכרתו- חדלו מביצוע הלחיצות והחלו בביצוע פעולות <a href='innerPage.html' onclick="(function () { localStorage.pageName = 'cardiopulmonaryResuscitation' + '/' + 'cardiopulmonaryResuscitation' + '/' + 'preperation'; })()"><b style="text-decoration:underline;">החייאה</b></a>.`,
]

const chokingContent = buildPreperationContent(chokingContentList, "chocking");

const chokingList = ["חנק", "choking", [chokingContent], "למידה ותרגול של טיפול בחנק יכולים להציל חיים"];

//החייאה
const cardiopulmonaryResuscitationContentList = ['מה צריך לעשות במקרה שהילד מפסיק לנשום?',
    'במקרה ואדם נוסף נמצא עמכם, בקשו שיחייג 101 למד"א. אם אתם לבד התחילו לבצע פעולת החייאה.',
    "השכיבו את הילד על גבו, על גבי מצע קשיח וכרעו סמוך לכתפיו וצווארו של הילד.",
    "הניחו את שורש כף היד במרכז החזה (על עצם בית החזה), בין הפטמות של הילד, ואגרפו מעליו את היד השנייה.",
    "החלו בלחיצות על בית החזה של הילד. לחיצות אצל ילדים קטנים (מתחת לגיל 8) יבוצעו באמצעות יד אחת בלבד ואצל ילדים גדולים בשתי הידיים.",
    "השתמשו במשקל גופכם תוך שאתם לוחצים על חזהו של הילד כלפי מטה בעומק של כשליש או שני שליש מעומק בית החזה.",
    "לחצו חזק ומהר ללא הפסקה לפי הקצב הבא: <a id='startBeat'> השמע קצב </a>",
    "המשיכו בביצוע החייאה עד הגעת אמבולנס או עד שהילד מתעורר.",
]

const cardiopulmonaryResuscitationContent = buildPreperationContent(cardiopulmonaryResuscitationContentList, "cardiopulmonaryResuscitation");

const cardiopulmonaryResuscitationList = ["החייאה", "cardiopulmonaryResuscitation", [cardiopulmonaryResuscitationContent], "החייאה מצילה חיים"];


//פונקציה לבניית מצגת הדרכה לנושאי חנק והחייאה
function buildPreperationContent(listItems, name) {
    var swiperItem = ``;
    var addActive = ``;
    var slideToSee = ``;
    listItems.forEach(ListItem => {
        //בדיקה האם זאת השקופית הראשונה, אם כן הוספה של המילה אקטיב לקלאס
        if (listItems.indexOf(ListItem) == 0) {
            addActive = "active";
            slideToSee = '<div id="slideToSee" class="d-block"><<< גללו ימינה </div>'
        }
        else {
            addActive = '';
            slideToSee = '';
        }
        swiperItem += `<div class="swiper-slide ${addActive} ${listItems.indexOf(ListItem)}">
                        <img class="d-block" src="images/${name}/${name}-Step${listItems.indexOf(ListItem)}.JPG">
                        <p class="d-block"><b class="prepLineNum"> שלב ${listItems.indexOf(ListItem)}:</b>   ${ListItem}</p> 
                        ${slideToSee}
                        </div>`
    })

    var contentToReturn = `
        <div class="swiper-container">
         <div class="swiper-pagination active"></div>
         <div class="swiper-wrapper">
        ${swiperItem}
         </div>
        </div>

  <div class="swiper-button-prev"></div>
  <div class="swiper-button-next"></div>
`

    return contentToReturn;
}


//כל תוכן ארון תרופות
const medicineCabinetContent = `<div class="medicineCabinetPage">
<div class="row justify-content-center">
<h4>המדריך המלא לארון תרופות<br\> בבית עם ילדים</h4>
</div>
<div class="panel-group row" id="accordion">
  <div class="panel panel-default col-12 mCAccordion">
    <div class="panel-heading">
         <a data-toggle="collapse" data-parent="#accordion" href="#placing" class="row justify-content-start dropdown-toggle">
        <img src="images/medicineCabinet/placing.png"></img>         
        <h5 class="panel-title">מיקום הארון</h5>
        </a>      
    </div>
    <div id="placing" class="panel-collapse collapse in">
        <p>
רצוי לבחור מקום ייעודי בבית לאחסון התרופות. <br/>
על מקום האחסון להיות קריר ויבש וכן רחוק מקרני השמש,<br/>
בנוסף, חשוב לוודא כי התרופות מאוחסנות בנפרד ממוצרי מזון או חומרי ניקיון <br/>
<b> והרחק מהישג ידם של ילדים</b>. 

        </p>
<ul>
<li>
אחסון בארון מטבח- יש לשים לב שהוא לא נמצא מעל הכיריים- בגלל החום<br/>
ולא מתחת לכיור- בגלל הלחות. </li>
<li> אין לאחסן תרופות בחדר הרחצה- מיקום זה חושף את התרופות לחום ולחות, <br/>
דבר הפוגע באיכותן ויציבותן. </li>
<li>ישנן תרופות הנדרשות לשמירה במקרר. רצוי לבחור פינה מוגדרת בתוך המקרר למטרה זו ולסמן אותה היטב-  <br/>
מומלץ לאחסן את התרופות בקופסת פלסטיק סגורה ולכתוב על גבה באופן ברור כי מדובר בתרופות.  </li>
<li>ניתן למצוא את כל ההוראות אודות מיקום ואחסון התרופות בעלון של התרופות.</li>
</ul>
    </div>
    </div>

  <div class="panel panel-default col-12 mCAccordion">
    <div class="panel-heading">
         <a data-toggle="collapse" data-parent="#accordion" href="#orgenize" class="row justify-content-start dropdown-toggle">
        <img src="images/medicineCabinet/orgenize.png"></img> 
        <h5 class="panel-title">ארגון</h5>
        </a>  
    </div>
    <div id="orgenize" class="panel-collapse collapse">
      <div class="panel-body">
        <p>
        ארגנו את ארון התרופות בצורה נכונה על מנת שתוכלו לאתר במהירות את התרופה הרצויה.   
        </p>
        <ul>
        <li>חלקו את התרופות לפי קטגוריות ושימו כל מקבץ בתא נפרד. ניתן להפריד לקטגוריות הבאות:
חום וכאבים, תרופות אנטיספטיות, משחות אנטיביוטיות, מערכת עיכול, אלרגיות וכו'... </li>
        <li>מומלץ לאחסן את התרופות בקופסאות המקוריות שלהן, בצירוף העלון לשימוש בתרופה-
בו מופיע מידע חשוב אודות השימוש, תוקף ומיקום אחסון התרופה. </li>
        <li>מומלץ לסדר את התרופות אחת אחרי השנייה, בכדי ליצור מקסימום נראות לשמות התרופות. </li>
        <li>חשוב לעבור על התרופות אחת לכמה חודשים בכדי לבדוק אם יש תרופות שפג תוקפן. </li>
        <li>אם התרופה שנתה את מראה, צורתה או צבעה- השליכו אותה לפח בלי קשר לתאריך התפוגה.
אותו דבר בתרופות שנדבקו, נשברו, נסדקו או שעטיפתן נקרעה.</li>
         <li><b>תרופות לילדים הניטלות על בסיס קבוע: </b> <br/>
מומלץ להשתמש בקופסת תרופות יומית או שבועית, חשוב לוודא מול רוקח כי ניתן לאחסן תרופות ספציפיות זו לצד זו- <br/>
זאת על מנת לא לייצר תגובה או הדבקה של התרופות. 
        </li>
        </ul>

        <p>
     <b> ומה עושים עם תרופות ישנות?</b> <br/>
תרופות יקרות שמצבן טוב ותוקפן לא פג יכולות להציל חיים של חולים אחרים.<br/>
ארגון "חברים לרפואה" מנתב תרופות, החל בתרופות למחלות כרוניות ועד לתרופות יקרות שאינן בסל הבריאות,<br/>
בין אנשים שנשארו בידיהם תרופות לבין חולים הזקוקים להן ולא מסוגלים לממנן. <br/>
את התרופות המיותרות ניתן לתרום דרך מוקד חברים לרפואה בטלפון: <a href="tel:+97235792220"> 03-5792220 </a> <br/>
או באתר הארגון <a href="http://www.haverim.org.il"> www.haverim.org.il </a>
        </p>
        </div>
    </div>
  </div>

  <div class="panel panel-default col-12 mCAccordion">
    <div class="panel-heading">
         <a data-toggle="collapse" data-parent="#accordion" href="#marking" class="row justify-content-start dropdown-toggle">
        <img src="images/medicineCabinet/marking.png"></img>         
        <h5 class="panel-title">סימון ורישום</h5>
        </a>  
    </div>
    <div id="marking" class="panel-collapse collapse">
      <div class="panel-body">       

        <p>
סימון ורישום התרופות הוא חשוב מאוד- הוא עוזר לשמור על סדר בארון התרופות,<br/>
מונע שימוש בתרופות שפג תוקפן ומקל על שליפת התרופות הנדרשות במהירות וביעילות בעת הצורך.
        </p>
<ul>
<li>
הדביקו מדבקה על גבי האריזת התרופה- עליה רשמו את תוקף התרופה, למה היא משמשת,<br/>
האם יש ליטול את התרופה לפני או אחרי האוכל ומה המינון המומלץ.</li>
<li> בעת פתיחת תרופה נוזלית, רשמו על האריזה את תאריך הפתיחה. אין להשתמש בסירופים, טיפות עיינים ותרופות נוזליות נוספות- חודש אחרי פתיחתם. </li>
</ul>
<p>דוגמא לסימון ורישום על גבי התרופה:
<img class="mcExample" src="images/medicineCabinet/markingImg.png" />
</p>
</div>
    </div>
  </div>

  <div class="panel panel-default col-12 mCAccordion">
    <div class="panel-heading">
         <a data-toggle="collapse" data-parent="#accordion" href="#treatment" class="row justify-content-start dropdown-toggle">
        <img src="images/medicineCabinet/treatment.png"></img>         
        <h5 class="panel-title">טיפול בתרופות</h5>
        </a> 
    </div>
    <div id="treatment" class="panel-collapse collapse">
      <div class="panel-body">
        <p>
        טיפול נכון בתרופות מונע מהן להתקלקל בטרם תוקפן פג 
ועוזר לשמור עליהן במצב אידיאלי לשימוש.
        </p>
        <ul>
        <li>שמרו על התרופות באריזה מקורית, המנעו מלהעביר אותן למכלים אחרים.</li>
        <li>אין להוציא את התרופות מהאריזה עד לשימוש.</li>
        <li>אין לגזור את האריזה על מנת לקבל כדור בודד,
זאת על מנת שלא לאבד את תאריך התפוגה המוטבע על גבי אריזת הכדורים. </li>
        <li>אין לחלק תרופה לשני חצאים אם אין עליה פס חצייה. </li>
        <li>חשוב לדעת כי ריסוק תרופות עלול לשבש את פעילותן,
לכן יש לבדוק בעלון התרופה אם ניתן לעשות זאת. </li>
 <li>הקפידו על סגירת אריזות התרופות היטב.
אם קיים סופח לחות באריזה (פלסטיק או שקית קטנה) – יש להשאיר אותו באריזה.  </li>
        </ul>
</div>
    </div>
  </div>
</div>`;


const medicineCabinetList = ["ארון תרופות", "medicineCabinet", [medicineCabinetContent], "כיצד מסדרים ארון תרופות בבית עם ילדים?"];

//const fixationsContent = "בלה בלה בלה אני תוכן של חבישות וקיבועים";
//const fixationsList = ["חבישות וקיבועים", "fixations", [fixationsContent], "תקציר חבישות וקיבועים"];

//משתנה להחזקת כל מערכי הכנה מראש 
export const preperationCategories = [cardiopulmonaryResuscitationList, chokingList, medicineCabinetList, /*fixationsList*/];


//משתנה להחזקת תוכן פנימי עמוד אודות
const aboutUsContentList = `<div class="row justify-content-center">
<img class="innerPageIcon" src="images/logo.png" /> 
</div>
<div class="aboutPage">
<div class="row justify-content-center">
<h5>הגשת עזרה ראשונה לילדים</h5>
</div>
<div class="row justify-content-center">
<h5>פרוייקט גמר תשפ"א</h5>
</div>
<a class="aboutFacLink row justify-content-center" target=”_blank” href="https://www.hit.ac.il/telem/overview">
<h6>הפקולטה לטכנולוגיות למידה</h6>
</a>
<h5>צוות הפרוייקט:</h5>
<span>טל ליבנה</span><br/>
<span>דניאלה זוהר</span>
<h5>מנחות:</h5>
<span>היילי וייגלט-מרום</span><br/>
<span>רעות טייטלר</span>
<h5>יוזמת הפרוייקט:</h5>
<span>אראלה פינס</span>
<div class="row justify-content-center">
<a target=”_blank” href="https://www.hit.ac.il">
 <img id="HITlogo" src="images/HITlogo.gif" /> 
</a>
</div>
<div id="contactUs">
<span>מצאתם תקלה באתר?</span><br/>
<span>מעוניינים להציע הצעה לשיפור?</span><br/>
<span>חושבים על שיתוף פעולה?</span><br/>
<span>צרו קשר עם יוזמת הפרוייקט, אראלה פינס, בכתובת:</span><br/>
<span>erella.pines@gmail.com</span>
</div>
<div id="cForRCBeat">
 &copy; מטרונום ההחייאה באתר לקוח מתוך האתר <a href="https://freesound.org/">Freesound</a>
</div>
</div>
`;

//משתנים להחזקת תוכן עמוד אודות
const aboutUsList = ["אודות", "aboutUs", aboutUsContentList];
export const aboutUs = [aboutUsList];

